# RuledCurtainElementLostCurves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..RuledCurtainElementLostCurves Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Ruled Curtain System cannot be built. The Lines or Edges used to create it cannot be found.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RuledCurtainElementLostCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RuledCurtainElementLostCurves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RuledCurtainElementLostCurves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace